=================================================
Datatype Exact Numerics tinyint
=================================================
SELECT CAST('3' as tinyint)
---

(tsql_file
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (function_call
                          (conversion_functions
                            (cast_)
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (string_lit))))
                            (AS)
                            (data_type
                              (tinyint_))))))))))))))))

=================================================
Datatype Exact Numerics smallint
=================================================
SELECT CAST('3' as smallint)
---

(tsql_file
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (function_call
                          (conversion_functions
                            (cast_)
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (string_lit))))
                            (AS)
                            (data_type
                              (smallint_))))))))))))))))

=================================================
Datatype Exact Numerics int
=================================================
SELECT CAST('3' as int)
---

(tsql_file
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (function_call
                          (conversion_functions
                            (cast_)
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (string_lit))))
                            (AS)
                            (data_type
                              (int_))))))))))))))))

=================================================
Datatype Exact Numerics bigint
=================================================
SELECT CAST('3' as bigint)
---

(tsql_file
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (function_call
                          (conversion_functions
                            (cast_)
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (string_lit))))
                            (AS)
                            (data_type
                              (bigint_))))))))))))))))

=================================================
Datatype Exact Numerics DECIMAL
=================================================
SELECT CAST('1' as DECIMAL(16))
---

(tsql_file
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (function_call
                          (conversion_functions
                            (cast_)
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (string_lit))))
                            (AS)
                            (data_type
                              (decimalty_)
                              (decimal_))))))))))))))))

=================================================
Datatype Exact Numerics DECIMAL PRECISION
=================================================
SELECT CAST('1' as DECIMAL(16,2))
---

(tsql_file
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (function_call
                          (conversion_functions
                            (cast_)
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (string_lit))))
                            (AS)
                            (data_type
                              (decimalty_)
                              (decimal_)
                              (decimal_))))))))))))))))

=================================================
Datatype Exact Numerics Numeric
=================================================
SELECT CAST('1' as NUMERIC(16))
---

(tsql_file
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (function_call
                          (conversion_functions
                            (cast_)
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (string_lit))))
                            (AS)
                            (data_type
                              (numeric_)
                              (decimal_))))))))))))))))

=================================================
Datatype Exact Numerics Numeric Precision
=================================================
SELECT CAST('1' as NUMERIC(16,2))
---

(tsql_file
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (function_call
                          (conversion_functions
                            (cast_)
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (string_lit))))
                            (AS)
                            (data_type
                              (numeric_)
                              (decimal_)
                              (decimal_))))))))))))))))

=================================================
Datatype Exact Numerics Money
=================================================
SELECT CAST('1' as MONEY)
---

(tsql_file
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (function_call
                          (conversion_functions
                            (cast_)
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (string_lit))))
                            (AS)
                            (data_type
                              (moneyty_))))))))))))))))

=================================================
Datatype Exact Numerics Smallmoney
=================================================
SELECT CAST('1' as SMALLMONEY)
---

(tsql_file
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (function_call
                          (conversion_functions
                            (cast_)
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (string_lit))))
                            (AS)
                            (data_type
                              (smallmoney_))))))))))))))))

=================================================
Datatype Exact Numerics Float
=================================================
SELECT CAST('1' as FLOAT)
---

(tsql_file
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (function_call
                          (conversion_functions
                            (cast_)
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (string_lit))))
                            (AS)
                            (data_type
                              (floatty_))))))))))))))))

=================================================
Datatype Exact Numerics Float Opt
=================================================
SELECT CAST('1' as FLOAT(16))
---

(tsql_file
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (function_call
                          (conversion_functions
                            (cast_)
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (string_lit))))
                            (AS)
                            (data_type
                              (floatty_)
                              (decimal_))))))))))))))))

=================================================
Datatype Exact Numerics Real
=================================================
SELECT CAST('1' as REAL)
---

(tsql_file
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (function_call
                          (conversion_functions
                            (cast_)
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (string_lit))))
                            (AS)
                            (data_type
                              (realty_))))))))))))))))

=================================================
Datatype Exact Numerics Real Opt
=================================================
SELECT CAST('1' as REAL(16))
---

(tsql_file
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (function_call
                          (conversion_functions
                            (cast_)
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (string_lit))))
                            (AS)
                            (data_type
                              (realty_)
                              (decimal_))))))))))))))))
